In [1]:
import pandas as pd
import numpy as np

##시각화
import matplotlib.pyplot as plt
import matplotlib
matplotlib.rcParams['font.family']='Malgun Gothic'
matplotlib.rcParams['axes.unicode_minus'] = False

In [22]:
data =  {'eng':[10,30,50,70],
         'kor':[20,40,60,80],
         'math':[90,50,20,70]}
df = pd.DataFrame(data, index=['a','b','c','d'] )
df

   eng  kor  math
a   10   20    90
b   30   40    50
c   50   60    20
d   70   80    70

### 산술연산

In [3]:
df+2

   eng  kor  math
a   12   22    92
b   32   42    52
c   52   62    22
d   72   82    72

In [5]:
df*2

   eng  kor  math
a   20   40   180
b   60   80   100
c  100  120    40
d  140  160   140

In [7]:
df['eng'] = [1,2,3,4]

In [10]:
df['eng'] = df['eng'] + 2

In [14]:
df.loc['a'] = df.loc['a']+2

In [17]:
df.loc[ 'b':'c', 'kor': ] = [ [1,2],[3,4] ]

In [20]:
df.loc[ 'b':'c', 'kor': ] = df.loc[ 'b':'c', 'kor': ] +2

### 관계 논리(& ,|, ~) 연산자

In [26]:
df[[True,True,False,True]]

   eng  kor  math
a   10   20    90
b   30   40    50
d   70   80    70

In [27]:
df[  df['eng'] >30 ] #영어점수가 30 보다 큰 로우를 선택

   eng  kor  math
c   50   60    20
d   70   80    70

In [30]:
# (sr == 30) | (sr== 70)
df[  (df['eng']==30) | (df['eng']==70) ]

   eng  kor  math
b   30   40    50
d   70   80    70

In [32]:
df[ df['eng'].isin( [30,70] ) ]

   eng  kor  math
b   30   40    50
d   70   80    70

In [34]:
sr = df['eng']
(sr>= 30) & (sr <=50)

a    False
b     True
c     True
d    False
Name: eng, dtype: bool

In [35]:
df[  (df['eng']>= 30) & (df['eng']<=50) ]

   eng  kor  math
b   30   40    50
c   50   60    20

In [37]:
df[ df['eng'].between( 30, 50) ]

   eng  kor  math
b   30   40    50
c   50   60    20

## query 문을 이용

In [38]:
# df[  df['eng'] >30 ] 
df.query( 'eng>30' )

   eng  kor  math
c   50   60    20
d   70   80    70

In [39]:
df.query( 'eng==30 or eng==50')

   eng  kor  math
b   30   40    50
c   50   60    20

In [40]:
df.query( '20< eng < 50 ')

   eng  kor  math
b   30   40    50

In [43]:
n = 30
# df[  df['eng'] >n ] 
df.query( f'eng>{n}' )

   eng  kor  math
c   50   60    20
d   70   80    70

In [23]:
df

   eng  kor  math
a   10   20    90
b   30   40    50
c   50   60    20
d   70   80    70